import { FC } from "react";
import Accordion from "../components/Accordion/Accordion";
import Container from "../components/Container/Container";

export const AboutUs: FC = () => {
	const accordionData = [
		{
			title: "Текст питання",
			content:
				"Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку.",
			customProp: "Custom Property Value 1",
		},
		{
			title: "Section 2",
			content:
				"Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку.",
			customProp: "Custom Property Value 2",
		},
		{
			title: "Section 3",
			content:
				"Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку. Ми підтримуємо кожного з наших героїв - ветеранів війни з Росією і запрошуємо знайти необхідну підтримку.",
			customProp: "Custom Property Value 3",
		},
	];

	return (
		<>
			<div
				className="bg-cover bg-center h-60 mb-20 md:mb-24"
				style={{ backgroundImage: 'url("./images/aboutUsBg.jpeg")' }}
			></div>
			<Container className="p-4 mb-20">
				<Accordion data={accordionData} />
			</Container>
		</>
	);
};
